#вариант 4
weights = {
    'A': 71.08,   # Аланин
    'C': 103.15,  # Цистеин
    'D': 115.09,  # Аспарагиновая кислота
    'E': 129.12,  # Глутаминовая кислота
    'F': 147.13,  # Фенилаланин
    'G': 57.05,   # Глицин
    'H': 137.14,  # Гистидин
    'I': 113.16,  # Изолейцин
    'K': 128.17,  # Лизин
    'L': 113.16,  # Лейцин
    'M': 131.19,  # Метионин
    'N': 114.11,  # Аспарагин
    'P': 97.12,   # Пролин
    'Q': 128.13,  # Глутамин
    'R': 156.19,  # Аргинин
    'S': 87.08,   # Серин
    'T': 101.11,  # Треонин
    'V': 99.14,   # Валин
    'W': 186.21,  # Триптофан
    'Y': 163.18   # Тирозин
}
p = input('Введите протеиновую последовательность: ')
if len(p) > 1000:
    print('Длина последовательности не должна превышать 1000 аминокислот')
else:
    def calc_weight(p):
        p_weight = sum(weights[aa] for aa in p)
        return p_weight
weight = calc_weight(p)
print(f"Вес строки P: {weight:.2f}")
